docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE52-d_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m01.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m02.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m03.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h00m04.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h00m05.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m06.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h00m07.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h00m08.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h00m09.9s/24h0m0s  27/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 41 MB   3.7 MB/s
     data_sent......................: 92 kB   8.4 kB/s
     http_req_blocked...............: avg=136.97µs min=240ns   med=271ns    max=4.46ms   p(90)=541ns    p(95)=751ns   
     http_req_connecting............: avg=24.9µs   min=0s      med=0s       max=778.57µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=147.91ms min=15.65ms med=80.32ms  max=414.27ms p(90)=280.71ms p(95)=285.15ms
       { expected_response:true }...: avg=147.91ms min=15.65ms med=80.32ms  max=414.27ms p(90)=280.71ms p(95)=285.15ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=4.18ms   min=64.82µs med=143.15µs max=14.04ms  p(90)=9.51ms   p(95)=9.93ms  
     http_req_sending...............: avg=214.63µs min=33.24µs med=63.47µs  max=5.94ms   p(90)=174.41µs p(95)=633.61µs
     http_req_tls_handshaking.......: avg=99.8µs   min=0s      med=0s       max=3.05ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=143.5ms  min=15.47ms med=80.08ms  max=405.82ms p(90)=270.62ms p(95)=276.23ms
     http_reqs......................: 61      5.588242/s
     iteration_duration.............: avg=352.08ms min=85.15ms med=356.01ms max=513.74ms p(90)=370.45ms p(95)=372.04ms
     iterations.....................: 30      2.748316/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m10.9s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m10.8s/24h0m0s  30/30 iters, 30 per VU